In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'key1': ['a',  'a', 'b', 'b', 'a'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1':np.random.randn(5),
    'data2':np.random.randn(5)
})

In [3]:
df

  key1 key2     data1     data2
0    a  one  1.055017 -0.205903
1    a  two  0.237977  1.982827
2    b  one -1.257960 -1.525958
3    b  two -0.635581  0.770448
4    a  one -0.450068 -0.188082

In [4]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [5]:
grouped.mean()

key1
a    0.280975
b   -0.946771
Name: data1, dtype: float64

In [6]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [7]:
means

key1  key2
a     one     0.302475
      two     0.237977
b     one    -1.257960
      two    -0.635581
Name: data1, dtype: float64

In [8]:
means.unstack()

key2       one       two
key1
a     0.302475  0.237977
b    -1.257960 -0.635581

In [9]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [10]:
states

array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'], dtype='<U10')

In [11]:
years = np.array([2005, 2005, 2006, 2006, 2005, 2006])

In [12]:
years

array([2005, 2005, 2006, 2006, 2005, 2006])

In [13]:
df['data1'].groupby([states, years]).mean()

ValueError: Grouper and axis must be same length

In [14]:
df

  key1 key2     data1     data2
0    a  one  1.055017 -0.205903
1    a  two  0.237977  1.982827
2    b  one -1.257960 -1.525958
3    b  two -0.635581  0.770448
4    a  one -0.450068 -0.188082

In [15]:
df['data1']

0    1.055017
1    0.237977
2   -1.257960
3   -0.635581
4   -0.450068
Name: data1, dtype: float64

In [16]:
df['data1'].groupby([states, years]).mean()

ValueError: Grouper and axis must be same length

In [17]:
states

array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'], dtype='<U10')

In [18]:
years

array([2005, 2005, 2006, 2006, 2005, 2006])

In [19]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [20]:
df['data1'].groupby([states, years]).mean()

California  2005    0.237977
            2006   -1.257960
Ohio        2005    0.209718
            2006   -0.450068
Name: data1, dtype: float64

In [21]:
df.groupby(df['key1']).mean()

         data1     data2
key1
a     0.280975  0.529614
b    -0.946771 -0.377755

In [22]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.280975  0.529614
b    -0.946771 -0.377755

In [23]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.302475 -0.196992
     two   0.237977  1.982827
b    one  -1.257960 -1.525958
     two  -0.635581  0.770448

In [24]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  1.055017 -0.205903
1    a  two  0.237977  1.982827
4    a  one -0.450068 -0.188082
b
  key1 key2     data1     data2
2    b  one -1.257960 -1.525958
3    b  two -0.635581  0.770448

In [25]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    pring(group)

('a', 'one')

NameError: name 'pring' is not defined

In [26]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  1.055017 -0.205903
4    a  one -0.450068 -0.188082
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.237977  1.982827
('b', 'one')
  key1 key2    data1     data2
2    b  one -1.25796 -1.525958
('b', 'two')
  key1 key2     data1     data2
3    b  two -0.635581  0.770448

In [27]:
(listdf.groupby('key1'))

NameError: name 'listdf' is not defined

In [28]:
list(df.groupby('key1'))

[('a',
    key1 key2     data1     data2
  0    a  one  1.055017 -0.205903
  1    a  two  0.237977  1.982827
  4    a  one -0.450068 -0.188082),
 ('b',
    key1 key2     data1     data2
  2    b  one -1.257960 -1.525958
  3    b  two -0.635581  0.770448)]

In [29]:
dict(list(df.groupby('key1')))

{'a':   key1 key2     data1     data2
 0    a  one  1.055017 -0.205903
 1    a  two  0.237977  1.982827
 4    a  one -0.450068 -0.188082,
 'b':   key1 key2     data1     data2
 2    b  one -1.257960 -1.525958
 3    b  two -0.635581  0.770448}

In [30]:
pieces = dict(list(df.groupby('key1')))

In [31]:
pieces['b']

  key1 key2     data1     data2
2    b  one -1.257960 -1.525958
3    b  two -0.635581  0.770448

In [32]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [33]:
grouped = df.groupby(df.dtypes, axis = 1)

In [34]:
grouped

In [35]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  1.055017 -0.205903
1  0.237977  1.982827
2 -1.257960 -1.525958
3 -0.635581  0.770448
4 -0.450068 -0.188082
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [36]:
df.groupby('key1')['dat1']

KeyError: 'Column not found: dat1'

In [37]:
df.groupby('key1')['data1']

In [38]:
df

  key1 key2     data1     data2
0    a  one  1.055017 -0.205903
1    a  two  0.237977  1.982827
2    b  one -1.257960 -1.525958
3    b  two -0.635581  0.770448
4    a  one -0.450068 -0.188082

In [39]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.196992
     two   1.982827
b    one  -1.525958
     two   0.770448

In [40]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [41]:
s_grouped

In [42]:
s_grouped.mean()

key1  key2
a     one    -0.196992
      two     1.982827
b     one    -1.525958
      two     0.770448
Name: data2, dtype: float64

In [43]:
people = pd.DataFrame(np.random.randn(5,5),
                     columns=['a', 'b', 'c', 'd', 'e'],
                     index = ['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [44]:
people

               a         b         c         d         e
Joe    -1.106796  1.241409 -0.167036 -1.393960 -0.425586
Steve  -0.314391  0.327374 -0.920335  0.615147  0.683407
Wes     2.509551  1.185704  0.108283 -0.044453  1.652884
Jim     1.730911  0.657277 -0.424902 -1.472372  0.822734
Travis -0.311737  0.291657 -0.605672 -1.868937  1.319431

In [45]:
people.iloc[2:3, [1,2]] = np.nan

In [46]:
people

               a         b         c         d         e
Joe    -1.106796  1.241409 -0.167036 -1.393960 -0.425586
Steve  -0.314391  0.327374 -0.920335  0.615147  0.683407
Wes     2.509551       NaN       NaN -0.044453  1.652884
Jim     1.730911  0.657277 -0.424902 -1.472372  0.822734
Travis -0.311737  0.291657 -0.605672 -1.868937  1.319431

In [47]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [48]:
mapping

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [49]:
by_column = people.groupby(mapping, axis = 1)

In [50]:
by_column.sum()

            blue       red
Joe    -1.560997 -0.290973
Steve  -0.305187  0.696390
Wes    -0.044453  4.162436
Jim    -1.897274  3.210922
Travis -2.474609  1.299351

In [51]:
map_series = pd.Series(mapping)

In [52]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [53]:
people.groupby(len).sum()

          a         b         c         d         e
3  3.133666  1.898686 -0.591938 -2.910785  2.050032
5 -0.314391  0.327374 -0.920335  0.615147  0.683407
6 -0.311737  0.291657 -0.605672 -1.868937  1.319431

In [54]:
people

               a         b         c         d         e
Joe    -1.106796  1.241409 -0.167036 -1.393960 -0.425586
Steve  -0.314391  0.327374 -0.920335  0.615147  0.683407
Wes     2.509551       NaN       NaN -0.044453  1.652884
Jim     1.730911  0.657277 -0.424902 -1.472372  0.822734
Travis -0.311737  0.291657 -0.605672 -1.868937  1.319431

In [55]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [56]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -1.106796  1.241409 -0.167036 -1.393960 -0.425586
  two  1.730911  0.657277 -0.424902 -1.472372  0.822734
5 one -0.314391  0.327374 -0.920335  0.615147  0.683407
6 two -0.311737  0.291657 -0.605672 -1.868937  1.319431

In [57]:
columns  = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'], 
                                     [1,3, 5,1,3]],
                                    names=  ['cty', 'tenor'])

In [58]:
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [59]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns = columns)

In [60]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.087550  0.289578  0.881030 -1.239639 -0.343692
1      0.896145 -1.609786  1.276551 -0.909665  1.188284
2     -0.573366  1.605303 -0.213169 -0.718827 -0.394999
3     -0.289244 -0.440959 -1.093790  0.130081 -0.166195

In [61]:
hier_df.groupby(level='cty', axis = 1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [62]:
people

               a         b         c         d         e
Joe    -1.106796  1.241409 -0.167036 -1.393960 -0.425586
Steve  -0.314391  0.327374 -0.920335  0.615147  0.683407
Wes     2.509551       NaN       NaN -0.044453  1.652884
Jim     1.730911  0.657277 -0.424902 -1.472372  0.822734
Travis -0.311737  0.291657 -0.605672 -1.868937  1.319431

In [63]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [64]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [66]:
obj2['a']

-5

In [67]:
col in ['','']: 
    print('haha')

SyntaxError: invalid syntax (1740563.py, line 1)

In [68]:
col

NameError: name 'col' is not defined

In [69]:
col = ''

In [70]:
if col in ['','']: 
    print('haha')

SyntaxError: invalid syntax (1740563.py, line 1)

In [71]:
['','']

['', '']

In [72]:
if col in ['','']: 
    print('haha')

haha

In [73]:
x = 1

In [74]:
(x + 1) if x == 1 : 0

SyntaxError: invalid syntax (953049392.py, line 1)

In [75]:
(x + 1) if x == 1 else 0

2